# BuiltInFailures.FamilyFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures Class
BuiltInFailures Class Members See Also
---
Failures related to families.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FamilyFailures
```

Visual Basic
---
```text
Public NotInheritable Class FamilyFailures
```

Visual C++
---
```text
public ref class FamilyFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FamilyFailures
# See Also
BuiltInFailures..::..FamilyFailures Members
Autodesk.Revit.DB Namespace